src/lib/sugarsoapBinding.set_entries.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns1="http://www.sugarcrm.com/sugarcrm">
 <SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <ns1:set_entries>
   <session></session>
   <module_name></module_name>
   <name_value_lists SOAP-ENC:arrayType="ArrayOfname-value[1]">
    <item>
     <item>
      <name></name>
      <value></value>
     </item>
    </item>
   </name_value_lists>
  </ns1:set_entries>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
